{
    "lessons": [
        {
            "number": "0",
            "title": "Описание учебного курса",
            "topics": [
                "Введение",
                "Сквозной сценарий",
                "Цели Обучения",
                "Результаты обучения",
                "Содержание курса"
            ],
            "skills": [],
            "tasks": [
                "Сформировать понимание содержания курса, ознакомиться со сквозным сценарием («Поиск и найм персонала»). См. ПС_Ознакомительный_Поиск_и_найм_персонала МЕА.json"
            ]
        },
        {
            "number": "1",
            "title": "Обзорный",
            "topics": [
                "Основные BPM-понятия;",
                "Обзор ПО, его преимуществ",
                "Ключевые понятия Comindware Platform",
                "Преимущества Comindware Platform: Моделирование процессов, Интерфейсы и аналитика, Управление данными, Расширенные функции, Управление доступом и навигация, Формирование отчётов, Обработка документов и файлов"
            ],
            "skills": [
                "Разбираться в BPMN-понятиях",
                "Определять преимущества Comindware Platform среди других BPMS-платформ"
            ],
            "tasks": [
                "Усвоить основные BPMN-понятия",
                "Разбираться в принципах управления Comindware Platform"
            ]
        },
        {
            "number": "2",
            "title": "Первый реестр данных",
            "topics": [
                "Вход в систему и смена пароля",
                "Приложение",
                "Шаблон записи",
                "Запись",
                "Атрибут",
                "Типы атрибутов",
                "Связанные шаблоны (1:1)",
                "Форма"
            ],
            "skills": [
                "Создавать приложение, шаблон записи, атрибуты",
                "Различать типы атрибутов (текст, число, дата и время, логический, запись)",
                "Создавать связанные шаблоны",
                "Создавать и редактировать форму записи",
                "Создавать и редактировать записи"
            ],
            "tasks": [
                "Войти под выданным логином и паролем в систему, перейти в «мой аккаунт», нажать кнопку «Сменить пароль»",
                "Создать БП «Управление персоналом»",
                "Создать шаблон записи «Кандидаты» с атрибутами:       - ФИО (текст)",
                "Результат тестирования – Тестирование пройдено/ Тестирование не пройдено (логический)",
                "Дата и время проведения собеседования (атрибут Дата)",
                "Оценка за прохождение собеседования (атрибут Число, число знаков после запятой – 0)",
                "Вынести атрибуты ФИО, Дата и время проведения собеседования, Оценка за прохождение собеседования на форму шаблона записи «Кандидаты»",
                "Создать шаблон записи «Вакансии»",
                "В шаблоне записи «Вакансии» создать вакансию (Текст, атрибут под названием «Вакансия» с включенным чекбоксом «Использовать как заголовок записей», вынести атрибут на форму шаблона записи) «Менеджер по продажам»",
                "В шаблоне записи «Кандидаты» создать атрибут Запись «Вакансия», связать атрибут с шаблоном записи «Вакансии», вынести атрибут на форму шаблона записи"
            ]
        },
        {
            "number": "3",
            "title": "Первый бизнес-процесс",
            "topics": [
                "Процесс",
                "Шаблон процесса",
                "Элементы диаграммы",
                "Простое начальное событие",
                "Простое конечное событие",
                "Пользовательская задача",
                "Развилка или/или",
                "Развилка и",
                "Пул и дорожка"
            ],
            "skills": [
                "Создавать процесс",
                "Публиковать процесс",
                "Понимать связи между процессом, записью и задачами",
                "Различать виды элементов диаграммы",
                "Создавать экземпляр процесса"
            ],
            "tasks": [
                "В приложении «Управление персоналом» создать шаблон процесса «Найм персонала», связать его с шаблоном записи «Кандидаты»",
                "Переименовать пул по умолчанию в пул «Обработка кандидата на открытую вакансию»",
                "Создать в пуле 3 дорожки (для ролей):",
                "HR-менеджер",
                "Нанимающий менеджер",
                "Служба безопасности",
                "Переименовать начальное событие в «Получены результаты тестирования» и конечное событие в «Кандидат не прошел тестирование», перетащить элементы в дорожку «HR-менеджер»",
                "Добавить на диаграмму процесса пользовательскую задачу «Зафиксировать результаты тестирования»",
                "Добавить на диаграмму процесса развилку «или/или» и еще один поток, исходящий от нее в дорожку «Нанимающий менеджер» и новую развилку «и»",
                "В свойствах развилки «или/или» указать поток «иначе»: «Кандидат не прошел тестирование» и добавить условие на развилку «и» - $имяатрибута (Результат тестирования)",
                "От развилки «и» создать 2 пользовательские задачи – «Провести собеседование» в дорожке «Нанимающий менеджер» и «Провести проверку кандидата» в дорожке «Служба безопасности»"
            ]
        },
        {
            "number": "4",
            "title": "Усовершенствование шаблона записи",
            "topics": [
                "Тип связи 1:М",
                "Взаимная связь",
                "Атрибут Документ",
                "Представление таблица для связанного шаблона",
                "Создание записей «на лету»"
            ],
            "skills": [
                "Создавать связанные шаблоны со связью 1:М",
                "Создавать и использовать атрибут Документ",
                "Добавлять записи «на лету»"
            ],
            "tasks": [
                "Создать еще один шаблон записи с названием «Документы кандидатов», в нем создать атрибут типа Документ и названием «Файл»",
                "Вернуться в настройку шаблона записи «Кандидаты», создать атрибут типа Запись (связанный шаблон – «Документы») с названием «Документы», хранить несколько значений, вынести на форму, выбрать представление – Таблица",
                "Создать шаблон записи «Типы документов», в нем атрибут типа Текст «Тип», чекбокс «Использовать как заголовок записей», вынести атрибут на форму",
                "В шаблоне записи «Документы кандидатов» создать атрибут Запись 1:1 «Тип», связь с шаблоном записи «Типы документов»",
                "Перейти в настройку формы пользовательской задачи на диаграмме процесса «Зафиксировать результаты тестирования» и вынести на нее основную форму шаблона записи «Кандидаты»",
                "Вынести в область по умолчанию атрибуты   Результат тестирования – Тестирование пройдено/ Тестирование не пройдено (логический)",
                "изменить доступ на «Требовать ввод»"
            ]
        },
        {
            "number": "5",
            "title": "Усовершенствование бизнес-процесса",
            "topics": [
                "Сценарии (максимум действие «Изменить значение атрибутов»)",
                "Вычисляемый атрибут",
                "Язык формул"
            ],
            "skills": [
                "Добавлять сценарий к процессу",
                "Применять действие изменить значения атрибутов",
                "Пользоваться редактором выражений",
                "Использовать формулы"
            ],
            "tasks": [
                "На диаграмме процесса перейти в задачу «Провести собеседование», на форму вынести основную форму шаблона записи «Кандидаты»",
                "В отдельную область вынести атрибуты из шаблона записи «Кандидаты»: Дата и время проведения собеседования, Оценка за прохождение собеседования,",
                "В шаблоне записи «Кандидаты» создать атрибут логический «Проверка службы безопасности»",
                "В пользовательской задаче «Провести проверку кандидата» вынести форму шаблона записи «Кандидаты» и отдельно в область атрибут «Проверка службы безопасности», переключатель с вариантами «Прошел проверку», «Не прошел», Требовать ввод",
                "Вынести два исходящих потока из задач «Провести собеседование» и «Провести проверку кандидата» в развилку «и» 2",
                "В развилке «и» 2 создать сценарий с действием «Изменить значения атрибутов», добавить атрибут «Результаты собеседования», операция «Заменить», выражение AND($Проверкаслужбыбезопасности,GREATEREQ($Оценказапрохождениесобеседования,8))",
                "Из развилки «и» 2 создать исходящий поток и развилку «или/или» 2 и пользовательскую задачу в дорожке «HR-менеджер»   «Сформировать и согласовать предложение с кандидатом», вынести форму шз «Кандидаты» и закрыть ее на чтение, добавить завершающее событие «Кандидат принят на работу»",
                "Из развилки «или/или» 2 создать исходящий поток в новое завершающее событие «Кандидат не прошел проверку»",
                "В развилке «или/или» 2 указать исходящий поток по умолчанию «Кандидат не прошел проверку», для потока «Сформировать и согласовать предложение с кандидатом» указать условие $Результатысобеседования",
                "Проверить и опубликовать диаграмму процесса"
            ]
        },
        {
            "number": "6",
            "title": "Мониторинг",
            "topics": [
                "Диаграмма модели данных",
                "Диаграмма бизнес-способностей",
                "Дашборды",
                "Таблица и фильтры",
                "Диаграмма процесса",
                "Токен"
            ],
            "skills": [
                "Строить диаграммы моделей",
                "Строить диаграмму бизнес-способностей",
                "Строить диаграммы (дашборды) для страниц",
                "Настраивать таблицу",
                "Настраивать фильтры к таблицам",
                "Управлять процессом с помощью диаграммы"
            ],
            "tasks": [
                "В разделе «Диаграммы» создать диаграмму модели данных «Найм кандидатов», выбрать «Показать связанные элементы»",
                "Создать диаграмму бизнес-способностей «Управление персоналом», вынести «Найм персонала», «Вакансии» к нему и «Кандидаты» к «Вакансии» и «Найм персонала»",
                "Создать раздел навигации «HR-менеджер»",
                "Создать страницу Рабочего стола, создать диаграмму «Процент прошедших собеседование кандидатов»: Кольцевая, шаблон – Кандидаты, Категории: Оценка за прохождение собеседования, Вычислять – Значения, Итоги по атрибуту   Оценка за прохождение собеседования, Периоды – Месяц, Квартал, Год",
                "Вынести страницу на Рабочий стол и задать название «HR»",
                "Создать несколько экземпляров шаблона процесса «Найм персонала», задавая различные значения атрибутам, приводящие к разным результатам",
                "Перейти в настройки таблицы шз «Кандидаты» и вынести колонки в таблицу: ФИО, Результат тестирования, Оценка за прохождение собеседования, Результаты собеседования",
                "Настроить фильтр на колонке «Результаты собеседования»"
            ]
        },
        {
            "number": "7",
            "title": "Управление доступом",
            "topics": [
                "Аккаунты",
                "Роли",
                "Права доступа",
                "Раздел навигации"
            ],
            "skills": [
                "Управлять аккаунтом",
                "Создавать новый аккаунт (?)",
                "Создавать роли",
                "Настраивать права доступа",
                "Понимать разницу между просмотром, редактированием и созданием"
            ],
            "tasks": [
                "Перейти в «Роли», создать 3 роли согласно шаблону процесса: HR-менеджер, Нанимающий менеджер, Служба безопасности",
                "Дать разрешение HR-менеджеру на Вакансии и Кандидаты – создание, просмотр, ввод данных, Документ кандидатов – создание, просмотр, ввод данных. Типы документов – просмотр и ввод данных. Создать в аккаунтах пользователя, и назначить его на роль.",
                "Нанимающему менеджеру – на Вакансии (создание, просмотр, ввод данных, удаление), Кандидаты (просмотр, ввод данных), Документы кандидатов и Типы документов – только просмотр. Создать в аккаунтах пользователя, и назначить его на роль.",
                "Служба безопасности – только просмотр Вакансии, Документы кандидатов, Типы документов. Кандидаты – просмотр и ввод данных. Создать в аккаунтах пользователя, и назначить его на роль."
            ]
        },
        {
            "number": "8",
            "title": "Экспорт данных",
            "topics": [
                "Подготовка шаблона экспорта",
                "Сопоставление атрибутов и ячеек Excel",
                "Экспорт отчёта",
                "Кнопка"
            ],
            "skills": [
                "Готовить шаблон Excel для экспорта данных",
                "Создавать кнопку для экспорта",
                "Экспортировать отчёт"
            ],
            "tasks": [
                "Перейти в шаблон записи «Кандидаты» и удалить фильтр на колонке таблицы",
                "В настройках шаблона записи «Кандидаты» перейти в шаблоны экспорта, создать шаблон «Отчет о найме»",
                "Создать файл Excel, указать в колонках в {} атрибуты ФИО, Оценка за прохождение  собеседования. Вложить файл в шаблон, задать имя выходного файла.",
                "Перейти в Кнопки – создать кнопку «Экспорт отчета», контекст операции – Запись, операция – Экспорт записи, результат выполнения – Скачать документ, шаблон экспорта – созданный шаблон экспорта.",
                "Перейти в Таблицы – Все записи, вынести кнопку на тулбар таблицы.",
                "Перейти в роль HR-менеджер и выдать разрешение на использование кнопки Экспорт отчета"
            ]
        }
    ],
    "summary": "Создать экземпляры шаблонов записи Кандидаты, Документы кандидатов, Вакансии, Типы документов. Создать экземпляр шаблона процесса Найм персонала и пройти его под ролями."
} 